In [1]:
import pandas as pd
items ={'Bob': pd.Series([245,25,55], ['bike','pants','watch']), 'Alice' : pd.Series([40,110,500,45], ['book','glasses','bike','pants'])}

In [2]:
carts = pd.DataFrame(items)
carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [3]:
data = {'Bob': pd.Series([245,25,55]), 'Alice': pd.Series([40,110,500,45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [4]:
carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [6]:
carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [7]:
carts.shape

(5, 2)

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
df.shape

(4, 2)

In [11]:
carts.size

10

In [17]:
Bob_cart = pd.DataFrame(carts, columns = ['Bob'])
Bob_cart

           Bob
bike     245.0
book       NaN
glasses    NaN
pants     25.0
watch     55.0

In [19]:
sel_carts = pd.DataFrame(carts, index = ['pants', 'watch','book'])
sel_carts

        Bob  Alice
pants  25.0   45.0
watch  55.0    NaN
book    NaN   40.0

In [20]:
Sel_alice = pd.DataFrame(carts, index = ['pants', 'book'], columns = ['Alice'])
Sel_alice

       Alice
pants   45.0
book    40.0

In [21]:
data = {'integers' : [1,2,3], 'Floats' : [4.5,8.2,9.6]}
data

{'integers': [1, 2, 3], 'Floats': [4.5, 8.2, 9.6]}

In [22]:
df = pd.DataFrame(data)
df

   integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [23]:
df = pd.DataFrame(data, index = ['label1', 'label2', 'label3'])
df

        integers  Floats
label1         1     4.5
label2         2     8.2
label3         3     9.6

In [57]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35} , {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items,index = ['store1', 'store2'])
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [58]:
store_items[['bikes']]

        bikes
store1     20
store2     15

In [59]:
store_items.loc[['store1'] ]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [60]:
store_items['bikes']['store2']  #列在前，行在后

15

In [61]:
store_items['shirts'] = 15, 2
store_items

        bikes  glasses  pants  watches  shirts
store1     20      NaN     30       35      15
store2     15     50.0      5       10       2

In [62]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

        bikes  glasses  pants  watches  shirts  suits
store1     20      NaN     30       35      15     45
store2     15     50.0      5       10       2      7

In [63]:
new_items = [{'watches' : 20, 'bikes': 30, 'pants': 23, 'shirts': 56}]
new_store = pd.DataFrame(new_items, index = ['store3'])
new_store

        bikes  pants  shirts  watches
store3     30     23      56       20

In [64]:
store_items = store_items.append(new_store)
store_items

        bikes  glasses  pants  shirts  suits  watches
store1     20      NaN     30      15   45.0       35
store2     15     50.0      5       2    7.0       10
store3     30      NaN     23      56    NaN       20

In [78]:
store_items['new_watches'] = store_items['watches'][1:2]
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store1     20      NaN     30      15   45.0     12       35          NaN
store2     15     50.0      5       2    7.0     23       10         10.0
store3     30      NaN     23      56    NaN      4       20          NaN

In [80]:
store_items.insert(5,'shoe',[12,23,4])
store_items

,bikes,glasses,pants,shirts,suits,shoe,shoes,watches,new_watches
store1,20,NaN,30,15,45.0,12,12,35,NaN
store2,15,50.0,5,2,7.0,23,23,10,10.0
store3,30,NaN,23,56,NaN,4,4,20,NaN

In [81]:
store_items.pop('new_watches')
store_items

        bikes  glasses  pants  shirts  suits  shoe  shoes  watches
store1     20      NaN     30      15   45.0    12     12       35
store2     15     50.0      5       2    7.0    23     23       10
store3     30      NaN     23      56    NaN     4      4       20

In [94]:
store_items.drop([ 'pants'], axis = 1)

        bikes  glasses  shirts  suits  shoes
store1     20      NaN      15   45.0     12
store2     15     50.0       2    7.0     23
store3     30      NaN      56    NaN      4

In [95]:
store_items.drop(['store1','store2'])

        bikes  glasses  pants  shirts  suits  shoes
store3     30      NaN     23      56    NaN      4

In [96]:
store_items.rename(columns = {'bikes' : 'hats'})

        hats  glasses  pants  shirts  suits  shoes
store1    20      NaN     30      15   45.0     12
store2    15     50.0      5       2    7.0     23
store3    30      NaN     23      56    NaN      4

In [97]:
store_items.rename(index = {'store3': 'last_store'})

            bikes  glasses  pants  shirts  suits  shoes
store1         20      NaN     30      15   45.0     12
store2         15     50.0      5       2    7.0     23
last_store     30      NaN     23      56    NaN      4

In [98]:
store_items = store_items.set_index('pants')
store_items

       bikes  glasses  shirts  suits  shoes
pants
30        20      NaN      15   45.0     12
5         15     50.0       2    7.0     23
23        30      NaN      56    NaN      4

In [105]:
store_items[['pants']]

KeyError: "['pants'] not in index"

In [106]:
stores = [{'bikes': 20, 'pants' : 30, 'shirts' : 15 , 'shoes': 5, 'suits': 45.0, 'watches': 35},
          {'bikes': 15, 'glasses': 50.0, 'pants': 5, 'shirts': 2.0, 'shoes' : 5, 'suits': 7.0, 'watches': 10}, 
         {'bikes': 20, 'glasses': 4.0, 'pants': 30, 'shoes': 10, 'watches': 35}]
store_items = pd.DataFrame(stores , index = ['store1', 'store2', 'store3'])
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      5   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [109]:
x = store_items.isnull().sum().sum()
print(x)

3

In [110]:
store_items.dropna(axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store2     15     50.0      5     2.0      5    7.0       10

In [111]:
store_items.dropna(axis=1)

        bikes  pants  shoes  watches
store1     20     30      5       35
store2     15      5      5       10
store3     20     30     10       35

In [112]:
store_items.fillna(0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      0.0     30    15.0      5   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     0.0     10    0.0       35

In [114]:
store_items.fillna(method = 'ffill', axis = 1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     20.0   30.0    15.0    5.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [116]:
store_items.fillna(method = 'backfill', axis = 1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20     50.0     30    15.0      5   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [117]:
store_items.interpolate(method = 'linear', axis = 1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     25.0   30.0    15.0    5.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [36]:
import pandas as pd
import numpy as np
pd.set_option('precision', 1)

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [40]:
dat ={'Book Title' : books, 'Authors' : authors, 'User 1' : user_1,  'User 2' : user_2, 'User 3' : user_3,  'User 4' : user_4}

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)
book_ratings

            Book Title              Authors  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [42]:
a1 = np.mean(user_1)
a2 = np.mean(user_2)
a3 = np.mean(user_3)

In [44]:
book_ratings['User 1'].fillna(a1, inplace = True)
book_ratings['User 2'].fillna(a2, inplace = True)
book_ratings['User 3'].fillna(a3, inplace = True)
book_ratings

            Book Title              Authors  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [54]:
best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)